<?php
/**
 * Created by PhpStorm.
 * User: eddielau
 * Date: 16/12/19
 * Time: 上午11:09
 */
return [
    'error' => [
        '9999' => '系统异常！',
        '9998' => '服务已关闭！',
        '9997' => '请求数据为空！',
        '9996' => '请求数据格式无效！',
        '9995' => '订购失败',
        '9994' => '超时订购转失败',
        '9090' => '订单重复！',
        '0001' => '客户接入ID为空！',
        '0002' => '订单号为空！',
        '0003' => '订单类型为空！',
        '0004' => '订单类型无效！',
        '0005' => '签名为空！',
        '0006' => '没有订购信息！',
        '0007' => '接入ID无效！',
        '0008' => '接入校验系统出错！',
        '0009' => '接入校验失败！',
        '0010' => '请求地址无效！',
        '0011' => '接入已停用！',
        '0012' => '接入无效！',
        '0013' => '客户无效！',
        '0014' => '客户无效！',
        '0015' => '无效的手机号(%s，无对应归属地及运营商！',
        '0016' => '未开通手机号(%s所在区域(%s',
        '0017' => '%s通道未开通或维护中',
        '0018' => '%s通道未开通{%s}流量！',
        '0019' => '未开通手机号[%s]所在区域充值！',
        '0020' => '无效的产品包代码[%s]！',
        '0021' => '不可匹配的流量！',
        '0022' => '余额不足！',
        '0023' => '网关处理失败！',
        '0024' => '无效的手机号%s，手机号长度不正确！',
        '0025' => '运营商不支持的流量！',
        '0026' => '状态报告无效！',
        '0027' => '未开通%s通道',
        '0028' => '生效方式为空！',
        '0029' => '充值号码为空！',
        '0030' => '无效的手机号！',
        '0031' => '不可识别的手机号[%s]！',
        '0032' => '不可识别的接入信息，接入ID[%s]！',
        '0033' => '网关通道不可用！',
        '0034' => '已无可切换网关通道！',
        '0035' => '可切换的网关通道无相同的流量包！',
        '0036' => '客户接入未开通[%s]通道[%s]流量产品！',
        '0037' => '订单长度超长，允许最大长度    %s',
        '0038' => '手机号长度超长，允许最大长度    %s',
        '0039' => '产品代码为空！',
        '0040' => '产品代码有错，长度超长！',
        '0041' => '无效的产品代码！'
    ]
];