<?php

return [
    'error' => [
        '000' => '成功',
        '001' => '鉴权参数缺失',
        '002' => '流量包ID为空',
        '003' => '手机号为空',
        '004' => '流量包ID错误(比如移动号充了联通流量)',
        '005' => '手机号码格式错误',
        '007' => '鉴权信息错误',
        '008' => 'token验证失败',
        '009' => '签名失败',
        '010' => '本月超出流量包叠加次数',
        '011' => '每秒并发过多',
        '012' => '不符合Ip白名单',
        '013' => 'app端口已失效',
        '014' => 'api版本不一致',
        '015' => '订单号为空',
        '016' => '订单号错误',
        '018' => '日期参数错误',
        '021' => '业务超出覆盖范围',
        '022' => '无效的合同或服务已终止',
        '023' => '流量包不在合同服务范围内',
        '024' => '流量总额超出合同规定大小',
        '025' => '单用户合同流量总额超过指定大小',
        '026' => '单用户日流量总额走过指定大小',
        '027' => '账号异常',
        '028' => '单用户下单超过合同规定次数',
        '029' => 'Ip不在白名单',
        '999' => '流米内部错误',
    ]
];